tap "homebrew/cask"
tap "atombender/ktail"
tap "mas-cli/tap"
tap "homebrew/cask-fonts"
#tap "chef/chef"
#tap "jakehilborn/jakehilborn" #for MacOS 'displayplacer'
brew "zsh"
brew "antigen"
brew "mas-cli/tap/mas"
brew "fontforge"
brew "svn" # needed by some of the font casks because they set "using: svn" 🤦
brew "colima"
brew "coreutils"
brew "kubernetes-cli"
brew "krew"
brew "berglas"
brew "stern"
brew "socat"
brew "python@3.10"
brew "jq"
brew "oq"
brew "ripgrep"
brew "git"
brew "terraform"
brew "go"
brew "bash"
brew "tmux"
brew "wget"
brew "joplin-cli"
brew "tcptraceroute"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "bash-completion"
brew "vim"
brew "helm"
brew "imagemagick"
brew "htop"
brew "watch"
brew "grep"
brew "pstree"
brew "findutils"
brew "gh"
brew "gnu-tar"
brew "gnu-sed"
brew "curl"
brew "awscli"
brew "python-yq"
brew "openssl@3"
brew "rg"
brew "fzf"
brew "mysql-client"
brew "yamllint"
brew "grip"
brew "shellcheck"
brew "numpy" # increases performance of `gcloud compute ssh --tunnel-through-iap` w/ "export CLOUDSDK_PYTHON_SITEPACKAGES=1" set
brew "bc"
brew "atombender/ktail/ktail"
brew "openjdk"
#brew "displayplacer"
#brew "gnu-tar", args: ["--with-default-names"]  ## this arg no longer works
#brew "libtool", args: ["--with-default-names"]
cask "slack"
cask "karabiner-elements"
cask "quicksilver"
cask "iterm2"
cask "google-cloud-sdk"
cask "google-chrome"
cask "1password"
cask "1password/tap/1password-cli"
cask "visual-studio-code"
cask "joplin"
cask "numi"
cask "subnetcalc"
cask "google-drive"
cask "cheatsheet"
cask "docker"
cask "xquartz"
cask "yubico-yubikey-manager"
cask "font-roboto"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-powerline-symbols"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
#cask "chefdk"
#cask "today-scripts"
mas "Yubico Authenticator", id: 1497506650
mas "Amphetamine", id: 937984704
mas "1Password for Safari", id: 1569813296
#mas "Ethernet Status Lite", id: 1227616292
# Xcode takes a LONG time to install, so maybe don't do it here.
#mas "Xcode", id: 497799835
#mas "Todoist: To-Do List & Tasks", id: 585829637

