tap "homebrew/cask"
#tap "chef/chef"
tap "jakehilborn/jakehilborn" #for MacOS 'displayplacer'
brew "zsh"
brew "antigen"
brew "mas-cli/tap/mas"
cask "slack"
cask "karabiner-elements"
cask "quicksilver"
cask "iterm2"
cask "viscosity"
cask "google-cloud-sdk"
cask "google-chrome"
cask "lastpass"
cask "1password"
cask "visual-studio-code"
cask "joplin"
cask "numi"
cask "subnetcalc"
cask "google-backup-and-sync"
cask "google-drive"
brew "fontforge"
brew "svn" # needed by some of the font casks because they set "using: svn" 🤦
cask "font-powerline-symbols"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "docker"
cask "cheatsheet"
cask "hammerspoon"
#cask "chefdk"
#cask "today-scripts"
brew "coreutils"
brew "kubernetes-cli"
brew "krew"
brew "berglas"
brew "jq"
brew "oq"
brew "ripgrep"
brew "git"
brew "terraform"
brew "go"
brew "bash"
brew "tmux"
brew "wget"
brew "joplin"
brew "tcptraceroute"
brew "bash-completion"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "vim"
brew "watch"
brew "grep"
brew "pstree"
brew "gh"
#brew "gnu-tar", args: ["--with-default-names"]  ## this arg no longer works
#brew "libtool", args: ["--with-default-names"]
brew "gnu-tar"
brew "rg"
brew "fzf"
brew "mysql-client"
brew "grip"
#brew "displayplacer"
mas "Yubico Authenticator", id: 1497506650
mas "Amphetamine", id: 937984704
#mas "Ethernet Status Lite", id: 1227616292
# Xcode takes a LONG time to install, so maybe don't do it here.
#mas "Xcode", id: 497799835
#mas "Todoist: To-Do List & Tasks", id: 585829637

